#language: ru

Функционал: Яндекс Маркет

  Сценарий: Поиск телевизора

    Когда выбран пункт меню "Маркет"
    И выбран пункт меню маркета "Электроника"
    И выбран раздел электроники "Телевизоры"
    И выполнено нажание на кнопку Все фильтры
    И ввод цены поиска От значением: "20000"
    И прокрутили страницу
    И выбран производитель: "Samsung"
    Также выбран производитель: "LG"
    Тогда нажатие кнопки: "Показать"
    Тогда проверяем что элементов на странице: "48"
    Тогда первый элемент на странице:
    Когда в поле поиска вводим значение первого элемента в списке
    И нажимаем кнопку Найти
    Тогда проверяем соответствие наименования товара


  Сценарий: Поиск наушников

    Когда выбран пункт меню "Маркет"
    И выбран пункт меню маркета "Электроника"
    И выбран раздел электроники "Беспроводные наушники"
    И выполнено нажание на кнопку Все фильтры
    И ввод цены поиска От значением: "5000"
    И прокрутили страницу
    И выбран производитель: "Beats"
    Тогда нажатие кнопки: "Показать"
    Тогда проверяем что элементов на странице: "11"
    Тогда первый элемент на странице:
    Когда в поле поиска вводим значение первого элемента в списке
    И нажимаем кнопку Найти
    Тогда проверяем соответствие наименования товара







